jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32F413/FS_NOR_HW_SPIFI_STM32F413_ST_32F413HDISCOVERY.c
/*********************************************************************
*                     SEGGER Microcontroller GmbH                    *
*                        The Embedded Experts                        *
**********************************************************************
*                                                                    *
*       (c) 2003 - 2022  SEGGER Microcontroller GmbH                 *
*                                                                    *
*       www.segger.com     Support: support_emfile@segger.com        *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile * File system for embedded applications               *
*                                                                    *
*                                                                    *
*       Please note:                                                 *
*                                                                    *
*       Knowledge of this file may under no circumstances            *
*       be used to write a similar product for in-house use.         *
*                                                                    *
*       Thank you for your fairness !                                *
*                                                                    *
**********************************************************************
*                                                                    *
*       emFile version: V5.18.1                                      *
*                                                                    *
**********************************************************************
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Microcontroller Systems LLC
Licensed to:              Cardinal Detecto, 102 East Daugherty St, Webb City, MO 64870
Licensed SEGGER software: emFile
License number:           FS-00842
License model:            SSL [Single Developer Single Platform Source Code License]
Licensed product:         -
Licensed platform:        Xtensa LX6 (ESP32), Eclipse
Licensed number of seats: 1
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2022-03-24 - 2022-09-24
Contact to extend SUA:    sales@segger.com
-------------------------- END-OF-HEADER -----------------------------

File      : FS_NOR_HW_SPIFI_STM32F413_ST_32F413HDISCOVERY.c
Purpose   : Low-level flash driver for STM32F4 QSPI interface.
Literature:
  [1] RM0430 Reference manual STM32F413/423 advanced ARM-based 32-bit MCUs
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32F4\ReferenceManual_STM32F413.pdf)
  [2] Datasheet STM32F413xG STM32F413xH
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32F4\Datasheet_STM32F413xH_STM32F413xG.pdf)
  [3] UM2135 User manual Discovery kit with STM32F413ZH MCU
    (\\FILESERVER\Techinfo\Company\ST\MCU\STM32\STM32F4\EvalBoard\STM32F413H-DISCO\UserManual_STM32F413ZH.pdf)
  [4] STM32F413xG/xH STM32F423xH Errata sheet
    (\\FILESERVER\Techinfo_rw\Company\ST\MCU\STM32\STM32F4\ErrataSheet_STM32F413xG_xH_STM32F423xH.pdf)
  [5] AN4031 Application note Using the STM32F2, STM32F4 and STM32F7 Series DMA controller
    (\\FILESERVER\Techinfo_rw\Company\ST\MCU\STM32\STM32F4\dm00046011-using-the-stm32f2-stm32f4-and-stm32f7-series-dma-controller-stmicroelectronics.pdf)

Additional information:
  FS_NOR_HW_USE_DMA_MEM_PORT can be used to work around the silicon
  limitation "2.2.7  In some specific cases, DMA2 data corruption occurs
  when managing AHB and APB2 peripherals in a concurrent way" documented
  in [4] by setting the value of this define to 1.
*/

/*********************************************************************
*
*       #include section
*
**********************************************************************
*/
#include "FS.h"

/*********************************************************************
*
*      Defines, configurable
*
**********************************************************************
*/
#ifndef   FS_NOR_HW_PER_CLK_HZ
  #define FS_NOR_HW_PER_CLK_HZ          100000000   // Clock of Quad-SPI unit
#endif

#ifndef   FS_NOR_HW_NOR_CLK_HZ
  #define FS_NOR_HW_NOR_CLK_HZ          50000000    // Frequency of the clock supplied to NOR flash device
#endif

#ifndef   FS_NOR_HW_USE_OS
  #define FS_NOR_HW_USE_OS              0           // Enables/disables the interrupt-driven operation.
                                                    // Permitted values:
                                                    //   0 - polling via CPU
                                                    //   1 - event-driven using embOS
                                                    //   2 - event-driven using other RTOS
#endif

#ifndef   FS_NOR_HW_USE_DMA
  #define FS_NOR_HW_USE_DMA             0           // Enables/disables the DMA support.
                                                    // Permitted values:
                                                    //   0 - data transferred via CPU
                                                    //   1 - data transferred via DMA
#endif

#ifndef   FS_NOR_HW_USE_DMA_MEM_PORT
  #define FS_NOR_HW_USE_DMA_MEM_PORT    0           // Configures the DMA port that has to be used for accessing the Quad-SPI unit.
                                                    //   0 - AHB peripheral port
                                                    //   1 - AHB memory port
#endif

/*********************************************************************
*
*       #include section, conditional
*
**********************************************************************
*/
#if FS_NOR_HW_USE_OS
  #include "stm32f4xx.h"
  #include "FS_OS.h"
#if (FS_NOR_HW_USE_OS == 1)
  #include "RTOS.h"
#endif // FS_NOR_HW_USE_OS == 1
#endif

/*********************************************************************
*
*       Defines, non-configurable
*
**********************************************************************
*/

/*********************************************************************
*
*       QSPI registers
*/
#define QUADSPI_BASE_ADDR       0xA0001000uL
#define QUADSPI_CR              (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x00))
#define QUADSPI_DCR             (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x04))
#define QUADSPI_SR              (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x08))
#define QUADSPI_FCR             (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x0C))
#define QUADSPI_DLR             (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x10))
#define QUADSPI_CCR             (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x14))
#define QUADSPI_AR              (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x18))
#define QUADSPI_ABR             (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x1C))
#define QUADSPI_DR              (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x20))
#define QUADSPI_DR_BYTE         (*(volatile U8  *)(QUADSPI_BASE_ADDR + 0x20))
#define QUADSPI_PSMKR           (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x24))
#define QUADSPI_PSMAR           (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x28))
#define QUADSPI_PIR             (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x2C))
#define QUADSPI_LPTR            (*(volatile U32 *)(QUADSPI_BASE_ADDR + 0x30))

/*********************************************************************
*
*       Port B registers
*/
#define GPIOB_BASE_ADDR         0x40020400uL
#define GPIOB_MODER             (*(volatile U32 *)(GPIOB_BASE_ADDR + 0x00))
#define GPIOB_OSPEEDR           (*(volatile U32 *)(GPIOB_BASE_ADDR + 0x08))
#define GPIOB_PUPDR             (*(volatile U32 *)(GPIOB_BASE_ADDR + 0x0C))
#define GPIOB_ODR               (*(volatile U32 *)(GPIOB_BASE_ADDR + 0x14))
#define GPIOB_AFRL              (*(volatile U32 *)(GPIOB_BASE_ADDR + 0x20))

/*********************************************************************
*
*       Port D registers
*/
#define GPIOD_BASE_ADDR         0x40020C00uL
#define GPIOD_MODER             (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x00))
#define GPIOD_OSPEEDR           (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x08))
#define GPIOD_PUPDR             (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x0C))
#define GPIOD_ODR               (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x14))
#define GPIOD_AFRL              (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x20))
#define GPIOD_AFRH              (*(volatile U32 *)(GPIOD_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Port E registers
*/
#define GPIOE_BASE_ADDR         0x40021000uL
#define GPIOE_MODER             (*(volatile U32 *)(GPIOE_BASE_ADDR + 0x00))
#define GPIOE_OSPEEDR           (*(volatile U32 *)(GPIOE_BASE_ADDR + 0x08))
#define GPIOE_PUPDR             (*(volatile U32 *)(GPIOE_BASE_ADDR + 0x0C))
#define GPIOE_ODR               (*(volatile U32 *)(GPIOE_BASE_ADDR + 0x14))
#define GPIOE_AFRL              (*(volatile U32 *)(GPIOE_BASE_ADDR + 0x20))
#define GPIOE_AFRH              (*(volatile U32 *)(GPIOE_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Port F registers
*/
#define GPIOF_BASE_ADDR         0x40021400uL
#define GPIOF_MODER             (*(volatile U32 *)(GPIOF_BASE_ADDR + 0x00))
#define GPIOF_OSPEEDR           (*(volatile U32 *)(GPIOF_BASE_ADDR + 0x08))
#define GPIOF_PUPDR             (*(volatile U32 *)(GPIOF_BASE_ADDR + 0x0C))
#define GPIOF_ODR               (*(volatile U32 *)(GPIOF_BASE_ADDR + 0x14))
#define GPIOF_AFRL              (*(volatile U32 *)(GPIOF_BASE_ADDR + 0x20))
#define GPIOF_AFRH              (*(volatile U32 *)(GPIOF_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Port G registers
*/
#define GPIOG_BASE_ADDR         0x40021800uL
#define GPIOG_MODER             (*(volatile U32 *)(GPIOG_BASE_ADDR + 0x00))
#define GPIOG_OSPEEDR           (*(volatile U32 *)(GPIOG_BASE_ADDR + 0x08))
#define GPIOG_PUPDR             (*(volatile U32 *)(GPIOG_BASE_ADDR + 0x0C))
#define GPIOG_ODR               (*(volatile U32 *)(GPIOG_BASE_ADDR + 0x14))
#define GPIOG_AFRL              (*(volatile U32 *)(GPIOG_BASE_ADDR + 0x20))
#define GPIOG_AFRH              (*(volatile U32 *)(GPIOG_BASE_ADDR + 0x24))

/*********************************************************************
*
*       Reset and clock control
*/
#define RCC_BASE_ADDR           0x40023800uL
#define RCC_AHB1RSTR            (*(volatile U32*)(RCC_BASE_ADDR + 0x10))
#define RCC_APB3RSTR            (*(volatile U32*)(RCC_BASE_ADDR + 0x18))
#define RCC_AHB1ENR             (*(volatile U32*)(RCC_BASE_ADDR + 0x30))
#define RCC_APB3ENR             (*(volatile U32*)(RCC_BASE_ADDR + 0x38))

/*********************************************************************
*
*       DMA 2 registers
*/
#define DMA2_BASE_ADDR          0x40026400uL
#define DMA2_STREAM_INDEX       7
#define DMA2_LISR               (*(volatile U32 *)(DMA2_BASE_ADDR + 0))
#define DMA2_HISR               (*(volatile U32 *)(DMA2_BASE_ADDR + 4))
#define DMA2_LIFCR              (*(volatile U32 *)(DMA2_BASE_ADDR + 8))
#define DMA2_HIFCR              (*(volatile U32 *)(DMA2_BASE_ADDR + 12))
#define DMA2_S7CR               (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * DMA2_STREAM_INDEX + 16))
#define DMA2_S7NDTR             (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * DMA2_STREAM_INDEX + 20))
#define DMA2_S7PAR              (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * DMA2_STREAM_INDEX + 24))
#define DMA2_S7M0AR             (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * DMA2_STREAM_INDEX + 28))
#define DMA2_S7FCR              (*(volatile U32 *)(DMA2_BASE_ADDR + 24 * DMA2_STREAM_INDEX + 36))

/*********************************************************************
*
*       Masks for the peripheral enable bits
*/
#define AHB1ENR_GPIOBEN         1
#define AHB1ENR_GPIODEN         3
#define AHB1ENR_GPIOEEN         4
#define AHB1ENR_GPIOFEN         5
#define AHB1ENR_GPIOGEN         6
#define AHB1ENR_DMA2EN          22
#define APB3ENR_QSPIEN          1

/*********************************************************************
*
*       GPIO bit positions of SPI signals
*/
#define NOR_NCS_BIT             6   // Port G
#define NOR_CLK_BIT             2   // Port B
#define NOR_D0_BIT              8   // Port F
#define NOR_D1_BIT              9   // Port F
#define NOR_D2_BIT              2   // Port E
#define NOR_D3_BIT              13  // Port D

/*********************************************************************
*
*       GPIO bits and masks
*/
#define OSPEEDR_HIGH            2uL
#define OSPEEDR_MASK            0x3uL
#define MODER_MASK              0x3uL
#define MODER_ALT               2uL
#define AFR_MASK                0x3uL

/*********************************************************************
*
*       Quad-SPI control register
*/
#define CR_EN_BIT               0
#define CR_ABORT_BIT            1
#define CR_DMAEN_BIT            2
#define CR_FTHRES_MASK          0x1Fu
#define CR_FTHRES_BIT           8
#define CR_TRIE_BIT             16
#define CR_TCIE_BIT             17
#define CR_FTIE_BIT             18
#define CR_SMIE_BIT             19
#define CR_TOIE_BIT             20
#define CR_APMS_BIT             22
#define CR_PRESCALER_BIT        24
#define CR_PRESCALER_MAX        255

/*********************************************************************
*
*       Quad-SPI device configuration register
*/
#define DCR_CKMODE_BIT          0
#define DCR_FSIZE_BIT           16
#define DCR_FSIZE_MAX           0x1FuL

/*********************************************************************
*
*       Quad-SPI status register
*/
#define SR_TEF_BIT              0
#define SR_TCF_BIT              1
#define SR_FTF_BIT              2
#define SR_SMF_BIT              3
#define SR_TOF_BIT              4
#define SR_BUSY_BIT             5
#define SR_FLEVEL_BIT           8
#define SR_FLEVEL_MASK          0x3FuL

/*********************************************************************
*
*       Quad-SPI communication configuration register
*/
#define CCR_INTRUCTION_BIT      0
#define CCR_IMODE_BIT           8
#define CCR_MODE_NONE           0
#define CCR_MODE_SINGLE         1uL
#define CCR_MODE_DUAL           2uL
#define CCR_MODE_QUAD           3uL
#define CCR_ADMODE_BIT          10
#define CCR_ADSIZE_BIT          12
#define CCR_ADSIZE_MASK         0x03uL
#define CCR_ABMODE_BIT          14
#define CCR_ABSIZE_BIT          16
#define CCR_ABSIZE_MASK         0x03uL
#define CCR_DCYC_BIT            18
#define CCR_DMODE_BIT           24
#define CCR_FMODE_BIT           26
#define CCR_FMODE_WRITE         0x0uL
#define CCR_FMODE_READ          0x1uL
#define CCR_FMODE_POLL          0x2uL
#define CCR_FMODE_MMAP          0x3uL
#define CCR_FMODE_MASK          0x3uL

/*********************************************************************
*
*       DMA2 related defines
*/
#define HIFCR_CFEIF7_BIT        22
#define HIFCR_CDMEIF7_BIT       24
#define HIFCR_CTCIF7_BIT        25
#define HIFCR_CHTIF7_BIT        26
#define HIFCR_CTEIF7_BIT        27
#define HISR_FEIF7_BIT          22
#define HISR_TEIF7_BIT          25
#define HISR_TCIF7_BIT          27
#define S7CR_EN_BIT             0
#define S7CR_TEIE_BIT           2
#define S7CR_TCIE_BIT           4
#define S7CR_DIR_M2P            1uL
#define S7CR_DIR_BIT            6
#define S7CR_PINC_BIT           9
#define S7CR_MINC_BIT           10
#define S7CR_PSIZE_32BIT        2uL
#define S7CR_PSIZE_BIT          11
#define S7CR_MSIZE_32BIT        2uL
#define S7CR_MSIZE_BIT          13
#define S7CR_PRIO_HIGH          3uL
#define S7CR_PRIO_BIT           16
#define S7CR_CHSEL_QUADSPI      3
#define S7CR_CHSEL_BIT          25
#define S7CR_PBURST_INCR4       1uL
#define S7CR_PBURST_BIT         21
#define S7CR_MBURST_INCR4       1uL
#define S7CR_MBURST_NONE        0uL
#define S7CR_MBURST_BIT         23

/*********************************************************************
*
*       Misc. defines
*/
#define NUM_BYTES_FIFO          32
#define CCR_DC_BIT              16
#define QUADSPI_PRIO            15
#define QUADSPI_MEM_SIZE_SHIFT  28                // Size of the memory region reserved for QUADSPI (256 MB)
#define DMA2_PRIO               15
#define WAIT_TIMEOUT_MS         1000
#define CYCLES_PER_MS           100               // Blocks the execution for about 1ms on a CPU running at 100 Mhz.
#define WAIT_TIMEOUT_CYCLES     (WAIT_TIMEOUT_MS * CYCLES_PER_MS)

/*********************************************************************
*
*      Static data
*
**********************************************************************
*/
#if FS_NOR_HW_USE_OS
  static volatile U32 _StatusQSPI;
#if FS_NOR_HW_USE_DMA
  static volatile U32 _StatusDMA;
#endif
#endif

/*********************************************************************
*
*      Static code
*
**********************************************************************
*/

/*********************************************************************
*
*       _CalcClockDivider
*/
static U8 _CalcClockDivider(U32 * pFreq_Hz) {
  U8  Div;
  U32 Freq_Hz;
  U32 MaxFreq_Hz;

  Div        = 0;
  MaxFreq_Hz = *pFreq_Hz;
  for (;;) {
    Freq_Hz = FS_NOR_HW_PER_CLK_HZ / (Div + 1);
    if (Freq_Hz <= MaxFreq_Hz) {
      break;
    }
    ++Div;
    if (Div == CR_PRESCALER_MAX) {
      break;
    }
  }
  *pFreq_Hz = Freq_Hz;
  return Div;
}

/*********************************************************************
*
*       _GetMode
*/
static U32 _GetMode(unsigned BusWidth, U32 NumBytes) {
  U32 Mode;

