jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32F413/FS_NOR_HW_SPIFI_STM32F413_ST_32F413HDISCOVERY.c
  Mode = CCR_MODE_NONE;
  if (NumBytes) {
    switch (BusWidth) {
    case 1:
      Mode = CCR_MODE_SINGLE;
      break;
    case 2:
      Mode = CCR_MODE_DUAL;
      break;
    case 4:
      Mode = CCR_MODE_QUAD;
      break;
    default:
      break;
    }
  }
  return Mode;
}

/*********************************************************************
*
*       _GetNumCycles
*/
static U32 _GetNumCycles(unsigned BusWidth, U32 NumBytes) {
  U32 NumCycles;

  NumCycles = 0;
  if (NumBytes) {
    NumCycles = NumBytes << 3;        // Assume 8-bits per byte.
    switch (BusWidth) {
    case 2:
      NumCycles >>= 1;
      break;
    case 4:
      NumCycles >>= 2;
      break;
    default:
      break;
    }
  }
  return NumCycles;
}

/*********************************************************************
*
*       _ClearFlags
*/
static void _ClearFlags(void) {
  QUADSPI_FCR = 0
              | (1uL << SR_TEF_BIT)
              | (1uL << SR_TCF_BIT)
              | (1uL << SR_SMF_BIT)
              | (1uL << SR_TOF_BIT)
              ;
  //
  // Wait for the flags to be cleared.
  //
  for (;;) {
    if ((QUADSPI_SR & ((1uL << SR_TEF_BIT) |
                       (1uL << SR_TCF_BIT) |
                       (1uL << SR_SMF_BIT) |
                       (1uL << SR_TOF_BIT))) == 0) {
      break;
    }
  }
}

/*********************************************************************
*
*       _Cancel
*/
static void _Cancel(void) {
  QUADSPI_CR |= 1uL << CR_ABORT_BIT;
  for (;;) {
    if ((QUADSPI_CR & (1uL << CR_ABORT_BIT)) == 0) {
      break;
    }
  }
}

/*********************************************************************
*
*       _WaitForTransferComplete
*/
static int _WaitForTransferComplete(void) {
  int r;
  U32 Status;

  r = 0;              // Set to indicate success.
#if FS_NOR_HW_USE_OS
  for (;;) {
    Status = _StatusQSPI;
    if (Status & (1uL << SR_TCF_BIT)) {
      break;
    }
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      break;
    }
  }
#else
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = QUADSPI_SR;
    if (Status & (1uL << SR_TCF_BIT)) {
      break;
    }
    if (--TimeOut == 0) {
      r = 1;
      break;
    }
  }
#endif
  return r;
}

/*********************************************************************
*
*       _WaitForData
*/
static int _WaitForData(U32 NumBytesExpected) {
  int r;
  U32 Status;
  U32 NumBytesAvail;

  r = 0;              // Set to indicate success.
#if FS_NOR_HW_USE_OS
  for (;;) {
    Status = _StatusQSPI;
    NumBytesAvail = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    if ((NumBytesAvail >= 4) || (NumBytesAvail >= NumBytesExpected)) {
      break;
    }
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      break;
    }
  }
#else
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = QUADSPI_SR;
    NumBytesAvail = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    if ((NumBytesAvail >= 4) || (NumBytesAvail >= NumBytesExpected)) {
      break;
    }
    if (--TimeOut == 0) {
      r = 1;
      break;
    }
  }
#endif // FS_NOR_HW_USE_OS
  return r;
}

/*********************************************************************
*
*       _WaitForFreeSpace
*/
static int _WaitForFreeSpace(U32 NumBytesExpected) {
  int r;
  U32 Status;
  U32 NumBytesFree;

  r = 0;              // Set to indicate success.
#if FS_NOR_HW_USE_OS
  for (;;) {
    Status = _StatusQSPI;
    NumBytesFree = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    NumBytesFree = NUM_BYTES_FIFO - NumBytesFree;
    if ((NumBytesFree >= 4) || (NumBytesFree >= NumBytesExpected)) {
      break;
    }
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      break;
    }
  }
#else
  U32 TimeOut;

  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    Status = QUADSPI_SR;
    NumBytesFree = (Status >> SR_FLEVEL_BIT) & SR_FLEVEL_MASK;
    NumBytesFree = NUM_BYTES_FIFO - NumBytesFree;
    if ((NumBytesFree >= 4) || (NumBytesFree >= NumBytesExpected)) {
      break;
    }
    if (--TimeOut == 0) {
      r = 1;
      break;
    }
  }
#endif // FS_NOR_HW_USE_OS
  return r;
}

/*********************************************************************
*
*       _ReadDataViaCPU
*/
static int _ReadDataViaCPU(U8 * pData, U32 NumBytes) {
  int r;
  U32 DataReg;

  do {
    //
    // Wait for the data to be received.
    //
    r = _WaitForData(NumBytes);
    if (r != 0) {
      break;
    }
    //
    // Read data and store it to destination buffer.
    //
    if (NumBytes < 4) {
      //
      // Read single bytes.
      //
      do {
        *pData++ = QUADSPI_DR_BYTE;
      } while (--NumBytes);
    } else {
      //
      // Read 4 bytes at a time.
      //
      DataReg = QUADSPI_DR;
      *pData++ = (U8)DataReg;
      *pData++ = (U8)(DataReg >> 8);
      *pData++ = (U8)(DataReg >> 16);
      *pData++ = (U8)(DataReg >> 24);
      NumBytes -= 4u;
    }
  } while (NumBytes != 0u);
  return r;
}

/*********************************************************************
*
*       _WriteDataViaCPU
*/
static int _WriteDataViaCPU(const U8 * pData, U32 NumBytes) {
  int r;
  U32 DataReg;

  do {
    //
    // Wait for free space in FIFO.
    //
    r = _WaitForFreeSpace(NumBytes);
    if (r != 0) {
      break;
    }
    //
    // Get the data from source buffer and write it.
    //
    if (NumBytes < 4u) {
      //
      // Write single bytes.
      //
      do {
        QUADSPI_DR_BYTE = *pData++;
      } while (--NumBytes);
    } else {
      //
      // Write 4 bytes at a time if possible.
      //
      DataReg  = (U32)*pData++;
      DataReg |= (U32)*pData++ << 8;
      DataReg |= (U32)*pData++ << 16;
      DataReg |= (U32)*pData++ << 24;
      NumBytes -= 4u;
      QUADSPI_DR = DataReg;
    }
  } while (NumBytes != 0u);
  return r;
}

#if FS_NOR_HW_USE_DMA

/*********************************************************************
*
*       _StartDMATransfer
*/
static void _StartDMATransfer(U32 * pData, U32 NumBytes, int IsWrite) {
  DMA2_S7CR   &= ~(1uL << S7CR_EN_BIT);                   // Stop the data transfer.
  while ((DMA2_S7CR & (1uL << S7CR_EN_BIT)) != 0u) {      // Wait for the stream to switch off.
    ;
  }
#if FS_NOR_HW_USE_DMA_MEM_PORT
  DMA2_S7M0AR = (U32)&QUADSPI_DR;
  DMA2_S7PAR  = (U32)pData;
#else
  DMA2_S7PAR  = (U32)&QUADSPI_DR;
  DMA2_S7M0AR = (U32)pData;
#endif // FS_NOR_HW_USE_DMA_MEM_PORT
  DMA2_S7NDTR = NumBytes >> 2;                            // We transfer 4 bytes at a time.
  DMA2_HIFCR  = 0                                         // Clear any pending interrupts.
              | (1uL << HIFCR_CDMEIF7_BIT)
              | (1uL << HIFCR_CTEIF7_BIT)
              | (1uL << HIFCR_CHTIF7_BIT)
              | (1uL << HIFCR_CTCIF7_BIT)
              | (1uL << HIFCR_CFEIF7_BIT)
              ;
  DMA2_S7CR   = 0
              | (S7CR_PSIZE_32BIT   << S7CR_PSIZE_BIT)    // Peripheral bus width
              | (S7CR_MSIZE_32BIT   << S7CR_MSIZE_BIT)    // Memory bus width
#if FS_NOR_HW_USE_DMA_MEM_PORT
              | (1uL                << S7CR_PINC_BIT)     // Peripheral increment enable
#else
              | (1uL                << S7CR_MINC_BIT)     // Memory increment enable
#endif // FS_NOR_HW_USE_DMA_MEM_PORT
              | (S7CR_PRIO_HIGH     << S7CR_PRIO_BIT)     // Set priority to high
              | (S7CR_CHSEL_QUADSPI << S7CR_CHSEL_BIT)    // Channel connected to QUADSPI peripheral
              ;
#if FS_NOR_HW_USE_DMA_MEM_PORT
  if (IsWrite == 0) {
#else
  if (IsWrite != 0) {
#endif // FS_NOR_HW_USE_DMA_MEM_PORT
    DMA2_S7CR |= S7CR_DIR_M2P << S7CR_DIR_BIT;
  }
#if FS_NOR_HW_USE_OS
  DMA2_S7CR   |= 0
              | (1uL << S7CR_TEIE_BIT)
              | (1uL << S7CR_TCIE_BIT)
              ;
  _StatusDMA  = 0;
#endif // FS_NOR_HW_USE_OS
#if (FS_NOR_HW_USE_DMA_MEM_PORT == 0)
  QUADSPI_CR  |= 0u
              | ((4u - 1u) << CR_FTHRES_BIT)              // Signal the DMA when 4 bytes are available or free.
              | (1uL       << CR_DMAEN_BIT)               // Enable the data transfer via DMA in QSPI controller.
              ;
#endif // FS_NOR_HW_USE_DMA_MEM_PORT == 0
  DMA2_S7CR   |= 1uL << S7CR_EN_BIT;                      // Start the data transfer
}

/*********************************************************************
*
*       _WaitForEndOfDMATransfer
*/
static int _WaitForEndOfDMATransfer(void) {
  U32 StatusQSPI;
  U32 StatusDMA;
  int r;

  r = 1;                    // Set to indicate an error.
#if FS_NOR_HW_USE_OS
  for (;;) {
    StatusQSPI = _StatusQSPI;
    StatusDMA  = _StatusDMA;
    if ((StatusDMA & (1uL << HISR_TEIF7_BIT)) != 0u) {
      break;                                              // Error, could not transfer data via DMA.
    }
    if ((StatusQSPI & (1uL << SR_TEF_BIT)) != 0) {
      break;                                              // Error, invalid address.
    }
    if ((StatusQSPI & (1uL << SR_TOF_BIT)) != 0) {
      break;                                              // Error, a timeout occurred.
    }
    if ((StatusDMA & (1uL << HISR_TCIF7_BIT)) != 0) {
#if FS_NOR_HW_USE_DMA_MEM_PORT
      //
      // It looks like the DMA does not transfer the last
      // 4 bytes read by the QUADSPI controller which means
      // that the QUADSPI controller remains in busy state
      // forever. We check here for this condition and if
      // true we read and discard the data so that the
      // QUADSPI controller can perform the next operation.
      // We know that we have to read only for 4 bytes because
      // the DMA is configured to work in direct mode and in
      // this mode the DMA can buffer only 4 bytes.
      //
      U32 Status;

      Status = QUADSPI_SR;
      if ((Status & (SR_FLEVEL_MASK << SR_FLEVEL_BIT)) != 0) {
        (void)QUADSPI_DR;
      }
#endif // FS_NOR_HW_USE_DMA_MEM_PORT
      r = 0;                                              // OK, data transferred.
      break;
    }
    r = FS_X_OS_Wait(WAIT_TIMEOUT_MS);
    if (r != 0) {
      break;
    }
  }
#else
  U32 TimeOut;

