jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32F413/FS_NOR_HW_SPIFI_STM32F413_ST_32F413HDISCOVERY.c
  TimeOut = WAIT_TIMEOUT_CYCLES;
  for (;;) {
    StatusQSPI = QUADSPI_SR;
    StatusDMA  = DMA2_HISR;
    if ((StatusDMA & (1uL << HISR_TEIF7_BIT)) != 0u) {
      break;                                              // Error, could not transfer data via DMA.
    }
    if ((StatusQSPI & (1uL << SR_TEF_BIT)) != 0) {
      break;                                              // Error, invalid address.
    }
    if ((StatusQSPI & (1uL << SR_TOF_BIT)) != 0) {
      break;                                              // Error, a timeout occurred.
    }
    if ((StatusDMA & (1uL << HISR_TCIF7_BIT)) != 0) {
      r = 0;                                              // OK, data transferred.
      break;
    }
    if (--TimeOut == 0) {
      break;                                              // Error, a timeout occurred.
    }
  }
#endif // FS_NOR_HW_USE_OS
  if (r != 0) {
    DMA2_S7CR = 0;                                        // Stop the data transfer in case of an error.
    while ((DMA2_S7CR & (1uL << S7CR_EN_BIT)) != 0u) {    // Wait for the stream to switch off
      ;
    }
  }
  QUADSPI_CR &= ~((1uL            << CR_DMAEN_BIT) |      // Disable the data transfer via DMA in QSPI controller and reset the FIFO threshold.
                  (CR_FTHRES_MASK << CR_FTHRES_BIT));
  return r;
}

/*********************************************************************
*
*      _IsDataAligned
*/
static int _IsDataAligned(const void * pData, U32 NumBytes) {
  if ((((U32)pData & 3u) == 0u) && ((NumBytes & 3u) == 0u)) {
    return 1;
  }
  return 0;
}

#endif // FS_NOR_HW_USE_DMA

/*********************************************************************
*
*      Public code (via callback)
*
**********************************************************************
*/

/*********************************************************************
*
*       _HW_Init
*
*  Function description
*    HW layer function. It is called before any other function of the physical layer.
*    It should configure the HW so that the other functions can access the NOR flash.
*
*  Return value
*    Frequency of the SPI clock in Hz.
*/
static int _HW_Init(U8 Unit) {
  U32 Div;
  U32 Freq_Hz;

  FS_USE_PARA(Unit);
  //
  // Enable the clocks of peripherals and reset them.
  //
  RCC_AHB1ENR  |= 0
               | (1uL << AHB1ENR_GPIOBEN)
               | (1uL << AHB1ENR_GPIODEN)
               | (1uL << AHB1ENR_GPIOEEN)
               | (1uL << AHB1ENR_GPIOFEN)
               | (1uL << AHB1ENR_GPIOGEN)
#if FS_NOR_HW_USE_DMA
               | (1uL << AHB1ENR_DMA2EN)
#endif
               ;
  RCC_APB3ENR  |=   1uL << APB3ENR_QSPIEN;
  RCC_APB3RSTR |=   1uL << APB3ENR_QSPIEN;
  RCC_APB3RSTR &= ~(1uL << APB3ENR_QSPIEN);
  //
  // Wait for the unit to exit reset.
  //
  for (;;) {
    if ((RCC_APB3RSTR & (1uL << APB3ENR_QSPIEN)) == 0) {
      break;
    }
  }
  //
  // NCS is an output signal and is controlled by the QUADSPI unit.
  //
  GPIOG_MODER   &= ~(MODER_MASK   << (NOR_NCS_BIT << 1));
  GPIOG_MODER   |=   MODER_ALT    << (NOR_NCS_BIT << 1);
  GPIOG_AFRL    &= ~(AFR_MASK     << (NOR_NCS_BIT << 2));
  GPIOG_AFRL    |=   0xAuL        << (NOR_NCS_BIT << 2);
  GPIOG_OSPEEDR &= ~(OSPEEDR_MASK << (NOR_NCS_BIT << 1));
  GPIOG_OSPEEDR |=   OSPEEDR_HIGH << (NOR_NCS_BIT << 1);
  //
  // CLK is an output signal controlled by the QUADSPI unit.
  //
  GPIOB_MODER   &= ~(MODER_MASK   << (NOR_CLK_BIT << 1));
  GPIOB_MODER   |=   MODER_ALT    << (NOR_CLK_BIT << 1);
  GPIOB_AFRL    &= ~(AFR_MASK     << (NOR_CLK_BIT << 2));
  GPIOB_AFRL    |=   0x9uL        << (NOR_CLK_BIT << 2);
  GPIOB_OSPEEDR &= ~(OSPEEDR_MASK << (NOR_CLK_BIT << 1));
  GPIOB_OSPEEDR |=   OSPEEDR_HIGH << (NOR_CLK_BIT << 1);
  //
  // D0 is an input/output signal controlled by the QUADSPI unit.
  //
  GPIOF_MODER   &= ~(MODER_MASK   << (NOR_D0_BIT << 1));
  GPIOF_MODER   |=   MODER_ALT    << (NOR_D0_BIT << 1);
  GPIOF_AFRH    &= ~(AFR_MASK     << ((NOR_D0_BIT - 8) << 2));
  GPIOF_AFRH    |=   0xAuL        << ((NOR_D0_BIT - 8) << 2);
  GPIOF_OSPEEDR &= ~(OSPEEDR_MASK << (NOR_D0_BIT << 1));
  GPIOF_OSPEEDR |=   OSPEEDR_HIGH << (NOR_D0_BIT << 1);
  //
  // D1 is an input/output signal controlled by the QUADSPI unit.
  //
  GPIOF_MODER   &= ~(MODER_MASK   << (NOR_D1_BIT << 1));
  GPIOF_MODER   |=   MODER_ALT    << (NOR_D1_BIT << 1);
  GPIOF_AFRH    &= ~(AFR_MASK     << ((NOR_D1_BIT - 8) << 2));
  GPIOF_AFRH    |=   0xAuL        << ((NOR_D1_BIT - 8) << 2);
  GPIOF_OSPEEDR &= ~(OSPEEDR_MASK << (NOR_D1_BIT << 1));
  GPIOF_OSPEEDR |=   OSPEEDR_HIGH << (NOR_D1_BIT << 1);
  //
  // D2 is an input/output signal and is controlled by the QUADSPI unit.
  //
  GPIOE_MODER   &= ~(MODER_MASK   << (NOR_D2_BIT << 1));
  GPIOE_MODER   |=   MODER_ALT    << (NOR_D2_BIT << 1);
  GPIOE_AFRL    &= ~(AFR_MASK     << (NOR_D2_BIT << 2));
  GPIOE_AFRL    |=   0x9uL        << (NOR_D2_BIT << 2);
  GPIOE_OSPEEDR &= ~(OSPEEDR_MASK << (NOR_D2_BIT << 1));
  GPIOE_OSPEEDR |=   OSPEEDR_HIGH << (NOR_D2_BIT << 1);
  //
  // D3 is an output signal and is controlled by the QUADSPI unit.
  //
  GPIOD_MODER   &= ~(MODER_MASK   << (NOR_D3_BIT << 1));
  GPIOD_MODER   |=   MODER_ALT    << (NOR_D3_BIT << 1);
  GPIOD_AFRH    &= ~(AFR_MASK     << ((NOR_D3_BIT - 8) << 2));
  GPIOD_AFRH    |=   0x9uL        << ((NOR_D3_BIT - 8) << 2);
  GPIOD_OSPEEDR &= ~(OSPEEDR_MASK << (NOR_D3_BIT << 1));
  GPIOD_OSPEEDR |=   OSPEEDR_HIGH << (NOR_D3_BIT << 1);
#if FS_NOR_HW_USE_OS
  //
  // Disable the interrupt and configure the priority.
  //
  NVIC_DisableIRQ(QUADSPI_IRQn);
  NVIC_SetPriority(QUADSPI_IRQn, QUADSPI_PRIO);
#if FS_NOR_HW_USE_DMA
  NVIC_DisableIRQ(DMA2_Stream7_IRQn);
  NVIC_SetPriority(DMA2_Stream7_IRQn, DMA2_PRIO);
#endif // FS_NOR_HW_USE_DMA
#endif
  //
  // Initialize the Quad-SPI controller.
  //
  Freq_Hz = FS_NOR_HW_NOR_CLK_HZ;
  Div = (U32)_CalcClockDivider(&Freq_Hz);
  QUADSPI_CR  = 0
              | (1uL << CR_EN_BIT)                  // Enable the Quad-SPI unit.
              | (Div << CR_PRESCALER_BIT)
              ;
  QUADSPI_DCR = 0
              | (1uL           << DCR_CKMODE_BIT)   // CLK signals stays HIGH when the NOR flash is not selected.
              | (DCR_FSIZE_MAX << DCR_FSIZE_BIT)    // We set the NOR flash size to maximum since this value is not known at this stage.
              ;
#if FS_NOR_HW_USE_OS
  //
  // Clear interrupt flags and enable the interrupt.
  //
  QUADSPI_CR  |= 0
              | (1uL << CR_APMS_BIT)
              | (1uL << CR_TRIE_BIT)
              | (1uL << CR_TCIE_BIT)
              | (1uL << CR_SMIE_BIT)
              | (1uL << CR_TOIE_BIT)
              ;
  QUADSPI_FCR  = 0
               | (1uL << SR_SMF_BIT)
               | (1uL << SR_TOF_BIT)
               | (1uL << SR_FTF_BIT)
               | (1uL << SR_TCF_BIT)
               | (1uL << SR_TEF_BIT)
               ;
  _StatusQSPI = 0;
  NVIC_EnableIRQ(QUADSPI_IRQn);
#if FS_NOR_HW_USE_DMA
  NVIC_EnableIRQ(DMA2_Stream7_IRQn);
#endif // FS_NOR_HW_USE_DMA
#endif
  return (int)Freq_Hz;
}

/*********************************************************************
*
*       _HW_SetCmdMode
*
*  Function description
*    HW layer function. It enables the direct access to NOR flash via SPI.
*    This function disables the memory-mapped mode.
*/
static void _HW_SetCmdMode(U8 Unit) {
  FS_USE_PARA(Unit);            // This device has only one HW unit.

  //
  // Cancel the memory mode so that the BUSY bit goes to 0
  // and we can write to QUADSPI_CCR register.
  //
  if ((QUADSPI_CCR & (CCR_FMODE_MASK << CCR_FMODE_BIT)) == (CCR_FMODE_MMAP << CCR_FMODE_BIT)) {
    _Cancel();
  }
}

/*********************************************************************
*
*       _HW_SetMemMode
*
*  Function description
*    HW layer function. It enables the memory-mapped mode. In this mode
*    the data can be accessed by doing read operations from memory.
*    The HW is responsible to transfer the data via SPI.
*    This function disables the direct access to NOR flash via SPI.
*/
static void _HW_SetMemMode(U8 Unit, U8 ReadCmd, unsigned NumBytesAddr, unsigned NumBytesDummy, U16 BusWidth) {
  U32 CfgReg;
  U32 CmdMode;
  U32 AddrMode;
  U32 DataMode;
  U32 NumCyclesDummy;
  U32 AddrSize;

  FS_USE_PARA(Unit);            // This device has only one HW unit.
  AddrSize = 0;
  if (NumBytesAddr) {
     AddrSize = (NumBytesAddr - 1) & CCR_ADSIZE_MASK;
  }
  NumCyclesDummy = _GetNumCycles(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesDummy);  // The dummy bytes are sent using the data mode.
  CmdMode        = _GetMode(FS_BUSWIDTH_GET_CMD(BusWidth), sizeof(ReadCmd));
  AddrMode       = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  DataMode       = _GetMode(FS_BUSWIDTH_GET_DATA(BusWidth), 1);                               // We read at least one byte.
  CfgReg = 0
         | (CCR_FMODE_MMAP << CCR_FMODE_BIT)
         | (DataMode       << CCR_DMODE_BIT)
         | (AddrSize       << CCR_ADSIZE_BIT)
         | (NumCyclesDummy << CCR_DCYC_BIT)
         | (AddrMode       << CCR_ADMODE_BIT)
         | (CmdMode        << CCR_IMODE_BIT)
         | (ReadCmd        << CCR_INTRUCTION_BIT)
         ;
  //
  // Wait until the unit is ready for the new command.
  //
  while (1) {
    if ((QUADSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
  }
  _ClearFlags();
  QUADSPI_CCR = CfgReg;
}

/*********************************************************************
*
*       _HW_ExecCmd
*
*  Function description
*    HW layer function. It requests the NOR flash to execute a simple command.
*    The HW has to be in SPI mode.
*/
static void _HW_ExecCmd(U8 Unit, U8 Cmd, U8 BusWidth) {
  U32 CfgReg;
  U32 CmdMode;

