jfazekas21/blackBird-ESP32-S3/components/JFS/Sample/Driver/NOR/ST_STM32F413/FS_NOR_HW_SPIFI_STM32F413_ST_32F413HDISCOVERY.c
  FS_USE_PARA(Unit);    // This device has only one HW unit.
  //
  // Fill local variables.
  //
  CmdMode = _GetMode(BusWidth, sizeof(Cmd));
  CfgReg  = 0
          | (CCR_FMODE_WRITE << CCR_FMODE_BIT)
          | (CmdMode         << CCR_IMODE_BIT)
          | (Cmd             << CCR_INTRUCTION_BIT)
          ;
  //
  // Wait until the unit is ready for the new command.
  //
  for (;;) {
    if ((QUADSPI_SR & (1uL << SR_BUSY_BIT)) == 0u) {
      break;
    }
  }
  //
  // Execute the command.
  //
  QUADSPI_DLR = 0;
  QUADSPI_ABR = 0;
  QUADSPI_CCR = CfgReg;
  //
  // Wait until the command has been completed.
  //
  for (;;) {
    if ((QUADSPI_SR & (1uL << SR_BUSY_BIT)) == 0u) {
      break;
    }
  }
}


/*********************************************************************
*
*       _HW_ReadData
*
*  Function description
*    HW layer function. It transfers data from NOR flash to MCU.
*    The HW has to be in SPI mode.
*/
static void _HW_ReadData(U8 Unit, U8 Cmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, U8 * pData, unsigned NumBytesData, U16 BusWidth) {
  U32 AddrReg;
  U32 AltReg;
  U32 CfgReg;
  U32 DataMode;
  U32 AddrMode;
  U32 AltMode;
  U32 CmdMode;
  U32 AltSize;
  U32 AddrSize;
  U32 NumBytes;
  U32 NumBytesAlt;
  U32 NumBytesToRead;

  FS_USE_PARA(Unit);    // This device has only one HW unit.
  //
  // Fill local variables.
  //
  AddrReg     = 0;
  AltReg      = 0;
  NumBytesAlt = NumBytesPara - NumBytesAddr;
  CmdMode     = _GetMode(FS_BUSWIDTH_GET_CMD(BusWidth), sizeof(Cmd));
  AddrMode    = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode     = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode    = _GetMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytesData);
  //
  // Encode the address.
  //
  if (NumBytesAddr) {
    NumBytes = NumBytesAddr;
    do {
      AddrReg <<= 8;
      AddrReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Encode the dummy and mode bytes.
  //
  if (NumBytesPara > NumBytesAddr) {
    NumBytes = NumBytesAlt;
    do {
      AltReg <<= 8;
      AltReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = (NumBytesAddr - 1) & CCR_ADSIZE_MASK;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = (NumBytesAlt - 1) & CCR_ABSIZE_MASK;
  }
  CfgReg = 0
         | (CCR_FMODE_READ << CCR_FMODE_BIT)
         | (DataMode       << CCR_DMODE_BIT)
         | (AltSize        << CCR_ABSIZE_BIT)
         | (AltMode        << CCR_ABMODE_BIT)
         | (AddrSize       << CCR_ADSIZE_BIT)
         | (AddrMode       << CCR_ADMODE_BIT)
         | (CmdMode        << CCR_IMODE_BIT)
         | (Cmd            << CCR_INTRUCTION_BIT)
         ;
  //
  // Wait until the unit is ready for the new command.
  //
  for (;;) {
    if ((QUADSPI_SR & (1uL << SR_BUSY_BIT)) == 0u) {
      break;
    }
  }
  //
  // Execute the command.
  //
  _ClearFlags();
  NumBytesToRead = NumBytesData - 1;        // 0 means "read 1 byte".
#if FS_NOR_HW_USE_DMA
  if (NumBytesData != 0u) {
    if (_IsDataAligned(pData, NumBytesData) != 0) {
#if FS_NOR_HW_USE_DMA_MEM_PORT
      //
      // According to section "4.9.1 Inverting transfers over DMA2 AHB ports consideration"
      // in [5] more data bytes have to be read in order to make sure that the DMA FIFO
      // is emptied on the last data transfer. In addition, the DMA transfer has to be started
      // after the QADSPI controller has been configured.
      //
      NumBytesToRead += 4;                  // In direct mode the DMA can queue a maximum of 4 bytes.
      QUADSPI_CR &= ~(CR_FTHRES_MASK << CR_FTHRES_BIT);
      QUADSPI_CR |= 1uL << CR_DMAEN_BIT;
#else
      _StartDMATransfer((U32 *)pData, NumBytesData, 0);
#endif // FS_NOR_HW_USE_DMA_MEM_PORT
    }
  }
#endif // FS_NOR_HW_USE_DMA
  if (NumBytesData) {
    QUADSPI_DLR = NumBytesToRead;
  }
  QUADSPI_ABR = AltReg;
  QUADSPI_CCR = CfgReg;
  if (NumBytesAddr) {
    QUADSPI_AR = AddrReg;
  }
  //
  // Read data from NOR flash.
  //
  if (NumBytesData != 0u) {
#if FS_NOR_HW_USE_DMA
    if (_IsDataAligned(pData, NumBytesData) != 0) {
#if FS_NOR_HW_USE_DMA_MEM_PORT
      _StartDMATransfer((U32 *)pData, NumBytesData, 0);
#endif // FS_NOR_HW_USE_DMA_MEM_PORT
      (void)_WaitForEndOfDMATransfer();
    } else
#endif // FS_NOR_HW_USE_DMA
    {
      (void)_ReadDataViaCPU(pData, NumBytesData);
    }
  }
  //
  // Wait until the data transfer has been completed.
  //
  (void)_WaitForTransferComplete();
}

/*********************************************************************
*
*       _HW_WriteData
*
*  Function description
*    HW layer function. It transfers data from MCU to NOR flash.
*    The HW has to be in SPI mode.
*/
static void _HW_WriteData(U8 Unit, U8 Cmd, const U8 * pPara, unsigned NumBytesPara, unsigned NumBytesAddr, const U8 * pData, unsigned NumBytesData, U16 BusWidth) {
  U32 AddrReg;
  U32 AltReg;
  U32 CfgReg;
  U32 DataMode;
  U32 AddrMode;
  U32 AltMode;
  U32 CmdMode;
  U32 AddrSize;
  U32 AltSize;
  U32 NumBytes;
  U32 NumBytesAlt;

  FS_USE_PARA(Unit);    // This device has only one HW unit.
  //
  // Fill local variables.
  //
  AddrReg     = 0;
  AltReg      = 0;
  NumBytesAlt = NumBytesPara - NumBytesAddr;
  CmdMode     = _GetMode(FS_BUSWIDTH_GET_CMD(BusWidth), sizeof(Cmd));
  AddrMode    = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAddr);
  AltMode     = _GetMode(FS_BUSWIDTH_GET_ADDR(BusWidth), NumBytesAlt);
  DataMode    = _GetMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytesData);
  //
  // Encode the address.
  //
  if (NumBytesAddr) {
    NumBytes = NumBytesAddr;
    do {
      AddrReg <<= 8;
      AddrReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  //
  // Encode the dummy and mode bytes.
  //
  if (NumBytesPara > NumBytesAddr) {
    NumBytes = NumBytesAlt;
    do {
      AltReg <<= 8;
      AltReg  |= (U32)(*pPara++);
    } while (--NumBytes);
  }
  AddrSize = 0;
  if (NumBytesAddr) {
    AddrSize = NumBytesAddr - 1;
  }
  AltSize = 0;
  if (NumBytesAlt) {
    AltSize = NumBytesAlt - 1;
  }
  CfgReg = 0
         | (CCR_FMODE_WRITE << CCR_FMODE_BIT)
         | (DataMode        << CCR_DMODE_BIT)
         | (AltSize         << CCR_ABSIZE_BIT)
         | (AltMode         << CCR_ABMODE_BIT)
         | (AddrSize        << CCR_ADSIZE_BIT)
         | (AddrMode        << CCR_ADMODE_BIT)
         | (CmdMode         << CCR_IMODE_BIT)
         | (Cmd             << CCR_INTRUCTION_BIT)
         ;
  //
  // Wait until the unit is ready for the new command.
  //
  for (;;) {
    if ((QUADSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
      break;
    }
  }
  //
  // Execute the command.
  //
  _ClearFlags();
#if FS_NOR_HW_USE_DMA
  if (NumBytesData != 0u) {
    if (_IsDataAligned(pData, NumBytesData) != 0) {
#if FS_NOR_HW_USE_DMA_MEM_PORT
      QUADSPI_CR &= ~(CR_FTHRES_MASK << CR_FTHRES_BIT);
      QUADSPI_CR |= 1uL << CR_DMAEN_BIT;
#endif // FS_NOR_HW_USE_DMA_MEM_PORT
    }
  }
#endif // FS_NOR_HW_USE_DMA
  if (NumBytesData) {
    QUADSPI_DLR = NumBytesData - 1;       // 0 means "write 1 byte".
  }
  QUADSPI_ABR = AltReg;
  QUADSPI_CCR = CfgReg;
  if (NumBytesAddr) {
    QUADSPI_AR = AddrReg;
  }
  //
  // Write data to NOR flash.
  //
  if (NumBytesData != 0u) {
#if FS_NOR_HW_USE_DMA
    if (_IsDataAligned(pData, NumBytesData) != 0) {
      _StartDMATransfer((U32 *)pData, NumBytesData, 1);
      (void)_WaitForEndOfDMATransfer();
    } else
#endif // FS_NOR_HW_USE_DMA
    {
      (void)_WriteDataViaCPU(pData, NumBytesData);
    }
  }
  //
  // Wait until the data transfer has been completed.
  //
  (void)_WaitForTransferComplete();
}

/*********************************************************************
*
*       _HW_Poll
*
*  Function description
*    HW layer function. Sends a command repeatedly and checks the
*    response for a specified condition.
*
*  Return value
*    > 0    Timeout occurred.
*    ==0    OK, bit set to specified value.
*    < 0    Feature not supported.
*
*  Additional information
*    The function executes periodically a command and waits
*    until specified bit in the response returned by the NOR flash
*    is set to a value specified by BitValue. The position of the bit
*    that has to be checked is specified by BitPos where 0 is the
*    position of the least significant bit in the byte.
*/
static int _HW_Poll(U8 Unit, U8 Cmd, U8 BitPos, U8 BitValue, U32 Delay, U32 TimeOut_ms, U16 BusWidth) {
  int r;

  FS_USE_PARA(Unit);
  r = -1;                 // Set to indicate that the feature is not supported.
#if FS_NOR_HW_USE_OS
  {
    U32 CfgReg;
    U32 DataMode;
    U32 CmdMode;
    U32 NumBytes;
    U32 DataMask;
    U32 DataMatch;
    U32 Status;

    //
    // Fill local variables.
    //
    DataMask    = 1uL           << BitPos;
    DataMatch   = (U32)BitValue << BitPos;
    Delay     <<= 4;          // 16 clock cycles are required to transfer 2 bytes.
    NumBytes    = 1;          // The response consists of only one byte.
    CmdMode     = _GetMode(FS_BUSWIDTH_GET_CMD(BusWidth), sizeof(Cmd));
    DataMode    = _GetMode(FS_BUSWIDTH_GET_DATA(BusWidth), NumBytes);
    CfgReg = 0
           | (CCR_FMODE_POLL << CCR_FMODE_BIT)
           | (DataMode       << CCR_DMODE_BIT)
           | (CmdMode        << CCR_IMODE_BIT)
           | (Cmd            << CCR_INTRUCTION_BIT)
           ;
    //
    // Wait until the unit is ready for the new command.
    //
    for (;;) {
      if ((QUADSPI_SR & (1uL << SR_BUSY_BIT)) == 0) {
        break;
      }
    }
    //
    // Start the poll operation. The end of operation is signaled by interrupt.
    //
    _ClearFlags();
    _StatusQSPI = 0;
    if (NumBytes) {
      QUADSPI_DLR = NumBytes - 1;           // 0 means "read 1 byte".
    }
    QUADSPI_PSMKR = DataMask;
    QUADSPI_PSMAR = DataMatch;
    QUADSPI_PIR   = Delay;
    QUADSPI_FCR   = 1uL << SR_SMF_BIT;
    QUADSPI_CCR   = CfgReg;
    for (;;) {
      Status = _StatusQSPI;
      if (Status & (1uL << SR_SMF_BIT)) {
        r = 0;                                // Bit set to the requested value.
        break;
      }
      r = FS_X_OS_Wait(TimeOut_ms);
      if (r != 0) {
        //
        // The timeout has expired. Cancel the poll operation.
        //
        _Cancel();
        r = 1;                                // A timeout occurred.
        break;
      }
    }
  }
#else
  FS_USE_PARA(Cmd);
  FS_USE_PARA(BitPos);
  FS_USE_PARA(BitValue);
  FS_USE_PARA(Delay);
  FS_USE_PARA(TimeOut_ms);
  FS_USE_PARA(BusWidth);
#endif
  return r;
}

/*********************************************************************
*
*       _HW_Delay
*
*  Function description
*    HW layer function. Blocks the execution for the specified number
*    of milliseconds.
*/
static int _HW_Delay(U8 Unit, U32 ms) {
  int r;

  FS_USE_PARA(Unit);
  r = -1;                 // Set to indicate that the feature is not supported.
#if FS_NOR_HW_USE_OS
  if (ms) {
    FS_X_OS_Delay(ms);
    r = 0;
  }
#else
  FS_USE_PARA(ms);
#endif
  return r;
}

/*********************************************************************
*
*       _HW_Lock
*
*  Function description
*    HW layer function. Requests exclusive access to the SPI bus.
*/
static void _HW_Lock(U8 Unit) {
  FS_USE_PARA(Unit);
}

/*********************************************************************
*
*       _HW_Unlock
*
*  Function description
*    HW layer function. Releases the exclusive access of the SPI bus.
*
*  Additional information
*    The configuration of the quad SPI controller has to be saved and
*    later restored in the _HW_Lock() function if the application
*    changes it.
*/
static void _HW_Unlock(U8 Unit) {
  FS_USE_PARA(Unit);
}

/*********************************************************************
*
*       Public code
*
**********************************************************************
*/
#if FS_NOR_HW_USE_OS

/*********************************************************************
*
*       QuadSPI_IRQHandler
*/
void QuadSPI_IRQHandler(void) {
#if (FS_NOR_HW_USE_OS == 1)
  OS_EnterNestableInterrupt();
#endif
  _StatusQSPI = QUADSPI_SR;
  QUADSPI_FCR = 0                    // Prevent other interrupts from occurring.
              | (1uL << SR_SMF_BIT)
              | (1uL << SR_TOF_BIT)
              | (1uL << SR_FTF_BIT)
              | (1uL << SR_TCF_BIT)
              | (1uL << SR_TEF_BIT)
              ;
  FS_X_OS_Signal();
#if (FS_NOR_HW_USE_OS == 1)
  OS_LeaveNestableInterrupt();
#endif
}

#if FS_NOR_HW_USE_DMA

/*********************************************************************
*
*       DMA2_Stream7_IRQHandler
*/
void DMA2_Stream7_IRQHandler(void) {
  U32 Status;

#if (FS_NOR_HW_USE_OS == 1)
  OS_EnterNestableInterrupt();
#endif
  Status      = DMA2_HISR;
  Status     &= 0               // Make sure that we clear only the flags assigned to the DMA stream we use.
             | (1uL << HIFCR_CFEIF7_BIT)
             | (1uL << HIFCR_CDMEIF7_BIT)
             | (1uL << HIFCR_CTCIF7_BIT)
             | (1uL << HIFCR_CHTIF7_BIT)
             | (1uL << HIFCR_CTEIF7_BIT)
             ;
  DMA2_HIFCR  = Status;         // Clear pending interrupt flags.
  _StatusDMA |= Status;         // Save the status to a static variable and check it in the task.
  FS_X_OS_Signal();             // Wake up the task.
#if (FS_NOR_HW_USE_OS == 1)
  OS_LeaveNestableInterrupt();
#endif
}

#endif // FS_NOR_HW_USE_DMA

#endif // FS_NOR_HW_USE_OS

/*********************************************************************
*
*       Public data
*
**********************************************************************
*/
const FS_NOR_HW_TYPE_SPIFI FS_NOR_HW_SPIFI_STM32F413_ST_32F413HDISCOVERY = {
  _HW_Init,
  _HW_SetCmdMode,
  _HW_SetMemMode,
  _HW_ExecCmd,
  _HW_ReadData,
  _HW_WriteData,
  _HW_Poll,
  _HW_Delay,
  _HW_Lock,
  _HW_Unlock,
  NULL,
  NULL,
  NULL,
  NULL,
  NULL
};

/*************************** End of file ****************************/
